grevaillot/svd_tools/headers/STM32G474xx/hrtim_common.h
/** @defgroup hrtim_common_adc2r ADC2R ADC Trigger 2 Register
@{*/

/** HRTIM_Common_ADC2R_AD2TERST ADC trigger 2 on Timer E Reset **/
#define HRTIM_Common_ADC2R_AD2TERST		(1 << 31)
/** HRTIM_Common_ADC2R_AD2TEC4 ADC trigger 2 on Timer E compare 4 **/
#define HRTIM_Common_ADC2R_AD2TEC4		(1 << 30)
/** HRTIM_Common_ADC2R_AD2TEC3 ADC trigger 2 on Timer E compare 3 **/
#define HRTIM_Common_ADC2R_AD2TEC3		(1 << 29)
/** HRTIM_Common_ADC2R_AD2TEC2 ADC trigger 2 on Timer E compare 2 **/
#define HRTIM_Common_ADC2R_AD2TEC2		(1 << 28)
/** HRTIM_Common_ADC2R_AD2TDRST ADC trigger 2 on Timer D Reset **/
#define HRTIM_Common_ADC2R_AD2TDRST		(1 << 27)
/** HRTIM_Common_ADC2R_AD2TDPER ADC trigger 2 on Timer D Period **/
#define HRTIM_Common_ADC2R_AD2TDPER		(1 << 26)
/** HRTIM_Common_ADC2R_AD2TDC4 ADC trigger 2 on Timer D compare 4 **/
#define HRTIM_Common_ADC2R_AD2TDC4		(1 << 25)
/** HRTIM_Common_ADC2R_AD2TDC3 ADC trigger 2 on Timer D compare 3 **/
#define HRTIM_Common_ADC2R_AD2TDC3		(1 << 24)
/** HRTIM_Common_ADC2R_AD2TDC2 ADC trigger 2 on Timer D compare 2 **/
#define HRTIM_Common_ADC2R_AD2TDC2		(1 << 23)
/** HRTIM_Common_ADC2R_AD2TCRST ADC trigger 2 on Timer C Reset **/
#define HRTIM_Common_ADC2R_AD2TCRST		(1 << 22)
/** HRTIM_Common_ADC2R_AD2TCPER ADC trigger 2 on Timer C Period **/
#define HRTIM_Common_ADC2R_AD2TCPER		(1 << 21)
/** HRTIM_Common_ADC2R_AD2TCC4 ADC trigger 2 on Timer C compare 4 **/
#define HRTIM_Common_ADC2R_AD2TCC4		(1 << 20)
/** HRTIM_Common_ADC2R_AD2TCC3 ADC trigger 2 on Timer C compare 3 **/
#define HRTIM_Common_ADC2R_AD2TCC3		(1 << 19)
/** HRTIM_Common_ADC2R_AD2TCC2 ADC trigger 2 on Timer C compare 2 **/
#define HRTIM_Common_ADC2R_AD2TCC2		(1 << 18)
/** HRTIM_Common_ADC2R_AD2TBPER ADC trigger 2 on Timer B Period **/
#define HRTIM_Common_ADC2R_AD2TBPER		(1 << 17)
/** HRTIM_Common_ADC2R_AD2TBC4 ADC trigger 2 on Timer B compare 4 **/
#define HRTIM_Common_ADC2R_AD2TBC4		(1 << 16)
/** HRTIM_Common_ADC2R_AD2TBC3 ADC trigger 2 on Timer B compare 3 **/
#define HRTIM_Common_ADC2R_AD2TBC3		(1 << 15)
/** HRTIM_Common_ADC2R_AD2TBC2 ADC trigger 2 on Timer B compare 2 **/
#define HRTIM_Common_ADC2R_AD2TBC2		(1 << 14)
/** HRTIM_Common_ADC2R_AD2TAPER ADC trigger 2 on Timer A Period **/
#define HRTIM_Common_ADC2R_AD2TAPER		(1 << 13)
/** HRTIM_Common_ADC2R_AD2TAC4 ADC trigger 2 on Timer A compare 4 **/
#define HRTIM_Common_ADC2R_AD2TAC4		(1 << 12)
/** HRTIM_Common_ADC2R_AD2TAC3 ADC trigger 2 on Timer A compare 3 **/
#define HRTIM_Common_ADC2R_AD2TAC3		(1 << 11)
/** HRTIM_Common_ADC2R_AD2TAC2 ADC trigger 2 on Timer A compare 2 **/
#define HRTIM_Common_ADC2R_AD2TAC2		(1 << 10)
/** HRTIM_Common_ADC2R_AD2EEV10 ADC trigger 2 on External Event 10 **/
#define HRTIM_Common_ADC2R_AD2EEV10		(1 << 9)
/** HRTIM_Common_ADC2R_AD2EEV9 ADC trigger 2 on External Event 9 **/
#define HRTIM_Common_ADC2R_AD2EEV9		(1 << 8)
/** HRTIM_Common_ADC2R_AD2EEV8 ADC trigger 2 on External Event 8 **/
#define HRTIM_Common_ADC2R_AD2EEV8		(1 << 7)
/** HRTIM_Common_ADC2R_AD2EEV7 ADC trigger 2 on External Event 7 **/
#define HRTIM_Common_ADC2R_AD2EEV7		(1 << 6)
/** HRTIM_Common_ADC2R_AD2EEV6 ADC trigger 2 on External Event 6 **/
#define HRTIM_Common_ADC2R_AD2EEV6		(1 << 5)
/** HRTIM_Common_ADC2R_AD2MPER ADC trigger 2 on Master Period **/
#define HRTIM_Common_ADC2R_AD2MPER		(1 << 4)
/** HRTIM_Common_ADC2R_AD2MC4 ADC trigger 2 on Master Compare 4 **/
#define HRTIM_Common_ADC2R_AD2MC4		(1 << 3)
/** HRTIM_Common_ADC2R_AD2MC3 ADC trigger 2 on Master Compare 3 **/
#define HRTIM_Common_ADC2R_AD2MC3		(1 << 2)
/** HRTIM_Common_ADC2R_AD2MC2 ADC trigger 2 on Master Compare 2 **/
#define HRTIM_Common_ADC2R_AD2MC2		(1 << 1)
/** HRTIM_Common_ADC2R_AD2MC1 ADC trigger 2 on Master Compare 1 **/
#define HRTIM_Common_ADC2R_AD2MC1		(1 << 0)

/**@}*/

/** @defgroup hrtim_common_adc3r ADC3R ADC Trigger 3 Register
@{*/

/** HRTIM_Common_ADC3R_AD1TEPER AD1TEPER **/
#define HRTIM_Common_ADC3R_AD1TEPER		(1 << 31)
/** HRTIM_Common_ADC3R_AD1TEC4 AD1TEC4 **/
#define HRTIM_Common_ADC3R_AD1TEC4		(1 << 30)
/** HRTIM_Common_ADC3R_AD1TEC3 AD1TEC3 **/
#define HRTIM_Common_ADC3R_AD1TEC3		(1 << 29)
/** HRTIM_Common_ADC3R_AD1TEC2 AD1TEC2 **/
#define HRTIM_Common_ADC3R_AD1TEC2		(1 << 28)
/** HRTIM_Common_ADC3R_AD1TDPER AD1TDPER **/
#define HRTIM_Common_ADC3R_AD1TDPER		(1 << 27)
/** HRTIM_Common_ADC3R_AD1TDC4 AD1TDC4 **/
#define HRTIM_Common_ADC3R_AD1TDC4		(1 << 26)
/** HRTIM_Common_ADC3R_AD1TDC3 AD1TDC3 **/
#define HRTIM_Common_ADC3R_AD1TDC3		(1 << 25)
/** HRTIM_Common_ADC3R_AD1TDC2 AD1TDC2 **/
#define HRTIM_Common_ADC3R_AD1TDC2		(1 << 24)
/** HRTIM_Common_ADC3R_AD1TCPER AD1TCPER **/
#define HRTIM_Common_ADC3R_AD1TCPER		(1 << 23)
/** HRTIM_Common_ADC3R_AD1TCC4 AD1TCC4 **/
#define HRTIM_Common_ADC3R_AD1TCC4		(1 << 22)
/** HRTIM_Common_ADC3R_AD1TCC3 AD1TCC3 **/
#define HRTIM_Common_ADC3R_AD1TCC3		(1 << 21)
/** HRTIM_Common_ADC3R_AD1TCC2 AD1TCC2 **/
#define HRTIM_Common_ADC3R_AD1TCC2		(1 << 20)
/** HRTIM_Common_ADC3R_AD1TBRST AD1TBRST **/
#define HRTIM_Common_ADC3R_AD1TBRST		(1 << 19)
/** HRTIM_Common_ADC3R_AD1TBPER AD1TBPER **/
#define HRTIM_Common_ADC3R_AD1TBPER		(1 << 18)
/** HRTIM_Common_ADC3R_AD1TBC4 AD1TBC4 **/
#define HRTIM_Common_ADC3R_AD1TBC4		(1 << 17)
/** HRTIM_Common_ADC3R_AD1TBC3 AD1TBC3 **/
#define HRTIM_Common_ADC3R_AD1TBC3		(1 << 16)
/** HRTIM_Common_ADC3R_AD1TBC2 AD1TBC2 **/
#define HRTIM_Common_ADC3R_AD1TBC2		(1 << 15)
/** HRTIM_Common_ADC3R_AD1TARST AD1TARST **/
#define HRTIM_Common_ADC3R_AD1TARST		(1 << 14)
/** HRTIM_Common_ADC3R_AD1TAPER AD1TAPER **/
#define HRTIM_Common_ADC3R_AD1TAPER		(1 << 13)
/** HRTIM_Common_ADC3R_AD1TAC4 AD1TAC4 **/
#define HRTIM_Common_ADC3R_AD1TAC4		(1 << 12)
/** HRTIM_Common_ADC3R_AD1TAC3 AD1TAC3 **/
#define HRTIM_Common_ADC3R_AD1TAC3		(1 << 11)
/** HRTIM_Common_ADC3R_AD1TAC2 AD1TAC2 **/
#define HRTIM_Common_ADC3R_AD1TAC2		(1 << 10)
/** HRTIM_Common_ADC3R_AD1EEV5 AD1EEV5 **/
#define HRTIM_Common_ADC3R_AD1EEV5		(1 << 9)
/** HRTIM_Common_ADC3R_AD1EEV4 AD1EEV4 **/
#define HRTIM_Common_ADC3R_AD1EEV4		(1 << 8)
/** HRTIM_Common_ADC3R_AD1EEV3 AD1EEV3 **/
#define HRTIM_Common_ADC3R_AD1EEV3		(1 << 7)
/** HRTIM_Common_ADC3R_AD1EEV2 AD1EEV2 **/
#define HRTIM_Common_ADC3R_AD1EEV2		(1 << 6)
/** HRTIM_Common_ADC3R_AD1EEV1 AD1EEV1 **/
#define HRTIM_Common_ADC3R_AD1EEV1		(1 << 5)
/** HRTIM_Common_ADC3R_AD1MPER AD1MPER **/
#define HRTIM_Common_ADC3R_AD1MPER		(1 << 4)
/** HRTIM_Common_ADC3R_AD1MC4 AD1MC4 **/
#define HRTIM_Common_ADC3R_AD1MC4		(1 << 3)
/** HRTIM_Common_ADC3R_AD1MC3 AD1MC3 **/
#define HRTIM_Common_ADC3R_AD1MC3		(1 << 2)
/** HRTIM_Common_ADC3R_AD1MC2 AD1MC2 **/
#define HRTIM_Common_ADC3R_AD1MC2		(1 << 1)
/** HRTIM_Common_ADC3R_AD1MC1 AD1MC1 **/
#define HRTIM_Common_ADC3R_AD1MC1		(1 << 0)

/**@}*/

/** @defgroup hrtim_common_adc4r ADC4R ADC Trigger 4 Register
@{*/

/** HRTIM_Common_ADC4R_AD2TERST AD2TERST **/
#define HRTIM_Common_ADC4R_AD2TERST		(1 << 31)
/** HRTIM_Common_ADC4R_AD2TEC4 AD2TEC4 **/
#define HRTIM_Common_ADC4R_AD2TEC4		(1 << 30)
/** HRTIM_Common_ADC4R_AD2TEC3 AD2TEC3 **/
#define HRTIM_Common_ADC4R_AD2TEC3		(1 << 29)
/** HRTIM_Common_ADC4R_AD2TEC2 AD2TEC2 **/
#define HRTIM_Common_ADC4R_AD2TEC2		(1 << 28)
/** HRTIM_Common_ADC4R_AD2TDRST AD2TDRST **/
#define HRTIM_Common_ADC4R_AD2TDRST		(1 << 27)
/** HRTIM_Common_ADC4R_AD2TDPER AD2TDPER **/
#define HRTIM_Common_ADC4R_AD2TDPER		(1 << 26)
/** HRTIM_Common_ADC4R_AD2TDC4 AD2TDC4 **/
#define HRTIM_Common_ADC4R_AD2TDC4		(1 << 25)
/** HRTIM_Common_ADC4R_AD2TDC3 AD2TDC3 **/
#define HRTIM_Common_ADC4R_AD2TDC3		(1 << 24)
/** HRTIM_Common_ADC4R_AD2TDC2 AD2TDC2 **/
#define HRTIM_Common_ADC4R_AD2TDC2		(1 << 23)
/** HRTIM_Common_ADC4R_AD2TCRST AD2TCRST **/
#define HRTIM_Common_ADC4R_AD2TCRST		(1 << 22)
/** HRTIM_Common_ADC4R_AD2TCPER AD2TCPER **/
#define HRTIM_Common_ADC4R_AD2TCPER		(1 << 21)
/** HRTIM_Common_ADC4R_AD2TCC4 AD2TCC4 **/
#define HRTIM_Common_ADC4R_AD2TCC4		(1 << 20)
/** HRTIM_Common_ADC4R_AD2TCC3 AD2TCC3 **/
#define HRTIM_Common_ADC4R_AD2TCC3		(1 << 19)
/** HRTIM_Common_ADC4R_AD2TCC2 AD2TCC2 **/
#define HRTIM_Common_ADC4R_AD2TCC2		(1 << 18)
/** HRTIM_Common_ADC4R_AD2TBPER AD2TBPER **/
#define HRTIM_Common_ADC4R_AD2TBPER		(1 << 17)
/** HRTIM_Common_ADC4R_AD2TBC4 AD2TBC4 **/
#define HRTIM_Common_ADC4R_AD2TBC4		(1 << 16)
/** HRTIM_Common_ADC4R_AD2TBC3 AD2TBC3 **/
#define HRTIM_Common_ADC4R_AD2TBC3		(1 << 15)
/** HRTIM_Common_ADC4R_AD2TBC2 AD2TBC2 **/
#define HRTIM_Common_ADC4R_AD2TBC2		(1 << 14)
/** HRTIM_Common_ADC4R_AD2TAPER AD2TAPER **/
#define HRTIM_Common_ADC4R_AD2TAPER		(1 << 13)
/** HRTIM_Common_ADC4R_AD2TAC4 AD2TAC4 **/
#define HRTIM_Common_ADC4R_AD2TAC4		(1 << 12)
/** HRTIM_Common_ADC4R_AD2TAC3 AD2TAC3 **/
#define HRTIM_Common_ADC4R_AD2TAC3		(1 << 11)
/** HRTIM_Common_ADC4R_AD2TAC2 AD2TAC2 **/
#define HRTIM_Common_ADC4R_AD2TAC2		(1 << 10)
/** HRTIM_Common_ADC4R_AD2EEV10 AD2EEV10 **/
#define HRTIM_Common_ADC4R_AD2EEV10		(1 << 9)
/** HRTIM_Common_ADC4R_AD2EEV9 AD2EEV9 **/
#define HRTIM_Common_ADC4R_AD2EEV9		(1 << 8)
/** HRTIM_Common_ADC4R_AD2EEV8 AD2EEV8 **/
#define HRTIM_Common_ADC4R_AD2EEV8		(1 << 7)
/** HRTIM_Common_ADC4R_AD2EEV7 AD2EEV7 **/
#define HRTIM_Common_ADC4R_AD2EEV7		(1 << 6)
/** HRTIM_Common_ADC4R_AD2EEV6 AD2EEV6 **/
#define HRTIM_Common_ADC4R_AD2EEV6		(1 << 5)
/** HRTIM_Common_ADC4R_AD2MPER AD2MPER **/
#define HRTIM_Common_ADC4R_AD2MPER		(1 << 4)
/** HRTIM_Common_ADC4R_AD2MC4 AD2MC4 **/
#define HRTIM_Common_ADC4R_AD2MC4		(1 << 3)
/** HRTIM_Common_ADC4R_AD2MC3 AD2MC3 **/
#define HRTIM_Common_ADC4R_AD2MC3		(1 << 2)
/** HRTIM_Common_ADC4R_AD2MC2 AD2MC2 **/
#define HRTIM_Common_ADC4R_AD2MC2		(1 << 1)
/** HRTIM_Common_ADC4R_AD2MC1 AD2MC1 **/
#define HRTIM_Common_ADC4R_AD2MC1		(1 << 0)

/**@}*/

/** @defgroup hrtim_common_dllcr DLLCR DLL Control Register
@{*/


#define HRTIM_Common_DLLCR_CALRTE_SHIFT		2
#define HRTIM_Common_DLLCR_CALRTE_MASK		0x03
/** @defgroup hrtim_common_dllcr_calrte CALRTE DLL Calibration rate
@{*/
/**@}*/

/** HRTIM_Common_DLLCR_CALEN DLL Calibration Enable **/
#define HRTIM_Common_DLLCR_CALEN		(1 << 1)
/** HRTIM_Common_DLLCR_CAL DLL Calibration Start **/
#define HRTIM_Common_DLLCR_CAL		(1 << 0)

/**@}*/

/** @defgroup hrtim_common_fltinr1 FLTINR1 HRTIM Fault Input Register 1
@{*/

/** HRTIM_Common_FLTINR1_FLT4LCK FLT4LCK **/
#define HRTIM_Common_FLTINR1_FLT4LCK		(1 << 31)

#define HRTIM_Common_FLTINR1_FLT4F_SHIFT		27
#define HRTIM_Common_FLTINR1_FLT4F_MASK		0x0f
/** @defgroup hrtim_common_fltinr1_flt4f FLT4F FLT4F
@{*/
/**@}*/

