grevaillot/svd_tools/headers/STM32G474xx/hrtim_common.h
/** HRTIM_Common_FLTINR1_FLT4SRC FLT4SRC **/
#define HRTIM_Common_FLTINR1_FLT4SRC		(1 << 26)
/** HRTIM_Common_FLTINR1_FLT4P FLT4P **/
#define HRTIM_Common_FLTINR1_FLT4P		(1 << 25)
/** HRTIM_Common_FLTINR1_FLT4E FLT4E **/
#define HRTIM_Common_FLTINR1_FLT4E		(1 << 24)
/** HRTIM_Common_FLTINR1_FLT3LCK FLT3LCK **/
#define HRTIM_Common_FLTINR1_FLT3LCK		(1 << 23)

#define HRTIM_Common_FLTINR1_FLT3F_SHIFT		19
#define HRTIM_Common_FLTINR1_FLT3F_MASK		0x0f
/** @defgroup hrtim_common_fltinr1_flt3f FLT3F FLT3F
@{*/
/**@}*/

/** HRTIM_Common_FLTINR1_FLT3SRC FLT3SRC **/
#define HRTIM_Common_FLTINR1_FLT3SRC		(1 << 18)
/** HRTIM_Common_FLTINR1_FLT3P FLT3P **/
#define HRTIM_Common_FLTINR1_FLT3P		(1 << 17)
/** HRTIM_Common_FLTINR1_FLT3E FLT3E **/
#define HRTIM_Common_FLTINR1_FLT3E		(1 << 16)
/** HRTIM_Common_FLTINR1_FLT2LCK FLT2LCK **/
#define HRTIM_Common_FLTINR1_FLT2LCK		(1 << 15)

#define HRTIM_Common_FLTINR1_FLT2F_SHIFT		11
#define HRTIM_Common_FLTINR1_FLT2F_MASK		0x0f
/** @defgroup hrtim_common_fltinr1_flt2f FLT2F FLT2F
@{*/
/**@}*/

/** HRTIM_Common_FLTINR1_FLT2SRC FLT2SRC **/
#define HRTIM_Common_FLTINR1_FLT2SRC		(1 << 10)
/** HRTIM_Common_FLTINR1_FLT2P FLT2P **/
#define HRTIM_Common_FLTINR1_FLT2P		(1 << 9)
/** HRTIM_Common_FLTINR1_FLT2E FLT2E **/
#define HRTIM_Common_FLTINR1_FLT2E		(1 << 8)
/** HRTIM_Common_FLTINR1_FLT1LCK FLT1LCK **/
#define HRTIM_Common_FLTINR1_FLT1LCK		(1 << 7)

#define HRTIM_Common_FLTINR1_FLT1F_SHIFT		3
#define HRTIM_Common_FLTINR1_FLT1F_MASK		0x0f
/** @defgroup hrtim_common_fltinr1_flt1f FLT1F FLT1F
@{*/
/**@}*/

/** HRTIM_Common_FLTINR1_FLT1SRC FLT1SRC **/
#define HRTIM_Common_FLTINR1_FLT1SRC		(1 << 2)
/** HRTIM_Common_FLTINR1_FLT1P FLT1P **/
#define HRTIM_Common_FLTINR1_FLT1P		(1 << 1)
/** HRTIM_Common_FLTINR1_FLT1E FLT1E **/
#define HRTIM_Common_FLTINR1_FLT1E		(1 << 0)

/**@}*/

/** @defgroup hrtim_common_fltinr2 FLTINR2 HRTIM Fault Input Register 2
@{*/


#define HRTIM_Common_FLTINR2_FLTSD_SHIFT		24
#define HRTIM_Common_FLTINR2_FLTSD_MASK		0x03
/** @defgroup hrtim_common_fltinr2_fltsd FLTSD FLTSD
@{*/
/**@}*/

/** HRTIM_Common_FLTINR2_FLT6SRC_1 FLT6SRC **/
#define HRTIM_Common_FLTINR2_FLT6SRC_1		(1 << 21)
/** HRTIM_Common_FLTINR2_FLT5SRC_1 FLT5SRC_1 **/
#define HRTIM_Common_FLTINR2_FLT5SRC_1		(1 << 20)
/** HRTIM_Common_FLTINR2_FLT4SRC_1 FLT4SRC_1 **/
#define HRTIM_Common_FLTINR2_FLT4SRC_1		(1 << 19)
/** HRTIM_Common_FLTINR2_FLT3SRC_1 FLT3SRC_1 **/
#define HRTIM_Common_FLTINR2_FLT3SRC_1		(1 << 18)
/** HRTIM_Common_FLTINR2_FLT2SRC_1 FLT2SRC_1 **/
#define HRTIM_Common_FLTINR2_FLT2SRC_1		(1 << 17)
/** HRTIM_Common_FLTINR2_FLT1SRC_1 FLT1SRC_1 **/
#define HRTIM_Common_FLTINR2_FLT1SRC_1		(1 << 16)
/** HRTIM_Common_FLTINR2_FLT6LCK FLT6LCK **/
#define HRTIM_Common_FLTINR2_FLT6LCK		(1 << 15)

#define HRTIM_Common_FLTINR2_FLT6F_SHIFT		11
#define HRTIM_Common_FLTINR2_FLT6F_MASK		0x0f
/** @defgroup hrtim_common_fltinr2_flt6f FLT6F FLT6F
@{*/
/**@}*/

/** HRTIM_Common_FLTINR2_FLT6SRC_0 FLT6F **/
#define HRTIM_Common_FLTINR2_FLT6SRC_0		(1 << 10)
/** HRTIM_Common_FLTINR2_FLT6P FLT6P **/
#define HRTIM_Common_FLTINR2_FLT6P		(1 << 9)
/** HRTIM_Common_FLTINR2_FLT6E FLT6E **/
#define HRTIM_Common_FLTINR2_FLT6E		(1 << 8)
/** HRTIM_Common_FLTINR2_FLT5LCK FLT5LCK **/
#define HRTIM_Common_FLTINR2_FLT5LCK		(1 << 7)

#define HRTIM_Common_FLTINR2_FLT5F_SHIFT		3
#define HRTIM_Common_FLTINR2_FLT5F_MASK		0x0f
/** @defgroup hrtim_common_fltinr2_flt5f FLT5F FLT5F
@{*/
/**@}*/

/** HRTIM_Common_FLTINR2_FLT5SRC FLT5SRC **/
#define HRTIM_Common_FLTINR2_FLT5SRC		(1 << 2)
/** HRTIM_Common_FLTINR2_FLT5P FLT5P **/
#define HRTIM_Common_FLTINR2_FLT5P		(1 << 1)
/** HRTIM_Common_FLTINR2_FLT5E FLT5E **/
#define HRTIM_Common_FLTINR2_FLT5E		(1 << 0)

/**@}*/

/** @defgroup hrtim_common_bdmupdr BDMUPDR BDMUPDR
@{*/

/** HRTIM_Common_BDMUPDR_MCMP4 MCMP4 **/
#define HRTIM_Common_BDMUPDR_MCMP4		(1 << 9)
/** HRTIM_Common_BDMUPDR_MCMP3 MCMP3 **/
#define HRTIM_Common_BDMUPDR_MCMP3		(1 << 8)
/** HRTIM_Common_BDMUPDR_MCMP2 MCMP2 **/
#define HRTIM_Common_BDMUPDR_MCMP2		(1 << 7)
/** HRTIM_Common_BDMUPDR_MCMP1 MCMP1 **/
#define HRTIM_Common_BDMUPDR_MCMP1		(1 << 6)
/** HRTIM_Common_BDMUPDR_MREP MREP **/
#define HRTIM_Common_BDMUPDR_MREP		(1 << 5)
/** HRTIM_Common_BDMUPDR_MPER MPER **/
#define HRTIM_Common_BDMUPDR_MPER		(1 << 4)
/** HRTIM_Common_BDMUPDR_MCNT MCNT **/
#define HRTIM_Common_BDMUPDR_MCNT		(1 << 3)
/** HRTIM_Common_BDMUPDR_MDIER MDIER **/
#define HRTIM_Common_BDMUPDR_MDIER		(1 << 2)
/** HRTIM_Common_BDMUPDR_MICR MICR **/
#define HRTIM_Common_BDMUPDR_MICR		(1 << 1)
/** HRTIM_Common_BDMUPDR_MCR MCR **/
#define HRTIM_Common_BDMUPDR_MCR		(1 << 0)

/**@}*/

/** @defgroup hrtim_common_bdtaupr BDTAUPR Burst DMA Timerx update Register
@{*/

/** HRTIM_Common_BDTAUPR_TIMxEEFR3 TIMxEEFR3 **/
#define HRTIM_Common_BDTAUPR_TIMxEEFR3		(1 << 22)
/** HRTIM_Common_BDTAUPR_TIMxCR2 TIMxCR2 **/
#define HRTIM_Common_BDTAUPR_TIMxCR2		(1 << 21)
/** HRTIM_Common_BDTAUPR_TIMxFLTR HRTIM_FLTxR register update enable **/
#define HRTIM_Common_BDTAUPR_TIMxFLTR		(1 << 20)
/** HRTIM_Common_BDTAUPR_TIMxOUTR HRTIM_OUTxR register update enable **/
#define HRTIM_Common_BDTAUPR_TIMxOUTR		(1 << 19)
/** HRTIM_Common_BDTAUPR_TIMxCHPR HRTIM_CHPxR register update enable **/
#define HRTIM_Common_BDTAUPR_TIMxCHPR		(1 << 18)
/** HRTIM_Common_BDTAUPR_TIMxRSTR HRTIM_RSTxR register update enable **/
#define HRTIM_Common_BDTAUPR_TIMxRSTR		(1 << 17)
/** HRTIM_Common_BDTAUPR_TIMxEEFR2 HRTIM_EEFxR2 register update enable **/
#define HRTIM_Common_BDTAUPR_TIMxEEFR2		(1 << 16)
/** HRTIM_Common_BDTAUPR_TIMxEEFR1 HRTIM_EEFxR1 register update enable **/
#define HRTIM_Common_BDTAUPR_TIMxEEFR1		(1 << 15)
/** HRTIM_Common_BDTAUPR_TIMxRST2R HRTIM_RST2xR register update enable **/
#define HRTIM_Common_BDTAUPR_TIMxRST2R		(1 << 14)
/** HRTIM_Common_BDTAUPR_TIMxSET2R HRTIM_SET2xR register update enable **/
#define HRTIM_Common_BDTAUPR_TIMxSET2R		(1 << 13)
/** HRTIM_Common_BDTAUPR_TIMxRST1R HRTIM_RST1xR register update enable **/
#define HRTIM_Common_BDTAUPR_TIMxRST1R		(1 << 12)
/** HRTIM_Common_BDTAUPR_TIMxSET1R HRTIM_SET1xR register update enable **/
#define HRTIM_Common_BDTAUPR_TIMxSET1R		(1 << 11)
/** HRTIM_Common_BDTAUPR_TIMx_DTxR HRTIM_DTxR register update enable **/
#define HRTIM_Common_BDTAUPR_TIMx_DTxR		(1 << 10)
/** HRTIM_Common_BDTAUPR_TIMxCMP4 HRTIM_CMP4xR register update enable **/
#define HRTIM_Common_BDTAUPR_TIMxCMP4		(1 << 9)
/** HRTIM_Common_BDTAUPR_TIMxCMP3 HRTIM_CMP3xR register update enable **/
#define HRTIM_Common_BDTAUPR_TIMxCMP3		(1 << 8)
/** HRTIM_Common_BDTAUPR_TIMxCMP2 HRTIM_CMP2xR register update enable **/
#define HRTIM_Common_BDTAUPR_TIMxCMP2		(1 << 7)
/** HRTIM_Common_BDTAUPR_TIMxCMP1 HRTIM_CMP1xR register update enable **/
#define HRTIM_Common_BDTAUPR_TIMxCMP1		(1 << 6)
/** HRTIM_Common_BDTAUPR_TIMxREP HRTIM_REPxR register update enable **/
#define HRTIM_Common_BDTAUPR_TIMxREP		(1 << 5)
/** HRTIM_Common_BDTAUPR_TIMxPER HRTIM_PERxR register update enable **/
#define HRTIM_Common_BDTAUPR_TIMxPER		(1 << 4)
/** HRTIM_Common_BDTAUPR_TIMxCNT HRTIM_CNTxR register update enable **/
#define HRTIM_Common_BDTAUPR_TIMxCNT		(1 << 3)
/** HRTIM_Common_BDTAUPR_TIMxDIER HRTIM_TIMxDIER register update enable **/
#define HRTIM_Common_BDTAUPR_TIMxDIER		(1 << 2)
/** HRTIM_Common_BDTAUPR_TIMxICR HRTIM_TIMxICR register update enable **/
#define HRTIM_Common_BDTAUPR_TIMxICR		(1 << 1)
/** HRTIM_Common_BDTAUPR_TIMxCR HRTIM_TIMxCR register update enable **/
#define HRTIM_Common_BDTAUPR_TIMxCR		(1 << 0)

/**@}*/

/** @defgroup hrtim_common_bdtbupr BDTBUPR Burst DMA Timerx update Register
@{*/

/** HRTIM_Common_BDTBUPR_TIMxEEFR3 TIMxEEFR3 **/
#define HRTIM_Common_BDTBUPR_TIMxEEFR3		(1 << 22)
/** HRTIM_Common_BDTBUPR_TIMxCR2 TIMxCR2 **/
#define HRTIM_Common_BDTBUPR_TIMxCR2		(1 << 21)
/** HRTIM_Common_BDTBUPR_TIMxFLTR HRTIM_FLTxR register update enable **/
#define HRTIM_Common_BDTBUPR_TIMxFLTR		(1 << 20)
/** HRTIM_Common_BDTBUPR_TIMxOUTR HRTIM_OUTxR register update enable **/
#define HRTIM_Common_BDTBUPR_TIMxOUTR		(1 << 19)
/** HRTIM_Common_BDTBUPR_TIMxCHPR HRTIM_CHPxR register update enable **/
#define HRTIM_Common_BDTBUPR_TIMxCHPR		(1 << 18)
/** HRTIM_Common_BDTBUPR_TIMxRSTR HRTIM_RSTxR register update enable **/
#define HRTIM_Common_BDTBUPR_TIMxRSTR		(1 << 17)
/** HRTIM_Common_BDTBUPR_TIMxEEFR2 HRTIM_EEFxR2 register update enable **/
#define HRTIM_Common_BDTBUPR_TIMxEEFR2		(1 << 16)
/** HRTIM_Common_BDTBUPR_TIMxEEFR1 HRTIM_EEFxR1 register update enable **/
#define HRTIM_Common_BDTBUPR_TIMxEEFR1		(1 << 15)
/** HRTIM_Common_BDTBUPR_TIMxRST2R HRTIM_RST2xR register update enable **/
#define HRTIM_Common_BDTBUPR_TIMxRST2R		(1 << 14)
/** HRTIM_Common_BDTBUPR_TIMxSET2R HRTIM_SET2xR register update enable **/
#define HRTIM_Common_BDTBUPR_TIMxSET2R		(1 << 13)
/** HRTIM_Common_BDTBUPR_TIMxRST1R HRTIM_RST1xR register update enable **/
#define HRTIM_Common_BDTBUPR_TIMxRST1R		(1 << 12)
/** HRTIM_Common_BDTBUPR_TIMxSET1R HRTIM_SET1xR register update enable **/
#define HRTIM_Common_BDTBUPR_TIMxSET1R		(1 << 11)
/** HRTIM_Common_BDTBUPR_TIMx_DTxR HRTIM_DTxR register update enable **/
#define HRTIM_Common_BDTBUPR_TIMx_DTxR		(1 << 10)
/** HRTIM_Common_BDTBUPR_TIMxCMP4 HRTIM_CMP4xR register update enable **/
#define HRTIM_Common_BDTBUPR_TIMxCMP4		(1 << 9)
/** HRTIM_Common_BDTBUPR_TIMxCMP3 HRTIM_CMP3xR register update enable **/
#define HRTIM_Common_BDTBUPR_TIMxCMP3		(1 << 8)
/** HRTIM_Common_BDTBUPR_TIMxCMP2 HRTIM_CMP2xR register update enable **/
#define HRTIM_Common_BDTBUPR_TIMxCMP2		(1 << 7)
/** HRTIM_Common_BDTBUPR_TIMxCMP1 HRTIM_CMP1xR register update enable **/
#define HRTIM_Common_BDTBUPR_TIMxCMP1		(1 << 6)
/** HRTIM_Common_BDTBUPR_TIMxREP HRTIM_REPxR register update enable **/
#define HRTIM_Common_BDTBUPR_TIMxREP		(1 << 5)
/** HRTIM_Common_BDTBUPR_TIMxPER HRTIM_PERxR register update enable **/
#define HRTIM_Common_BDTBUPR_TIMxPER		(1 << 4)
/** HRTIM_Common_BDTBUPR_TIMxCNT HRTIM_CNTxR register update enable **/
#define HRTIM_Common_BDTBUPR_TIMxCNT		(1 << 3)
/** HRTIM_Common_BDTBUPR_TIMxDIER HRTIM_TIMxDIER register update enable **/
#define HRTIM_Common_BDTBUPR_TIMxDIER		(1 << 2)
/** HRTIM_Common_BDTBUPR_TIMxICR HRTIM_TIMxICR register update enable **/
#define HRTIM_Common_BDTBUPR_TIMxICR		(1 << 1)
/** HRTIM_Common_BDTBUPR_TIMxCR HRTIM_TIMxCR register update enable **/
#define HRTIM_Common_BDTBUPR_TIMxCR		(1 << 0)

/**@}*/

/** @defgroup hrtim_common_bdtcupr BDTCUPR Burst DMA Timerx update Register
@{*/

