grevaillot/svd_tools/headers/STM32G474xx/hrtim_common.h
/** HRTIM_Common_BDTCUPR_TIMxEEFR3 TIMxEEFR3 **/
#define HRTIM_Common_BDTCUPR_TIMxEEFR3		(1 << 22)
/** HRTIM_Common_BDTCUPR_TIMxCR2 TIMxCR2 **/
#define HRTIM_Common_BDTCUPR_TIMxCR2		(1 << 21)
/** HRTIM_Common_BDTCUPR_TIMxFLTR HRTIM_FLTxR register update enable **/
#define HRTIM_Common_BDTCUPR_TIMxFLTR		(1 << 20)
/** HRTIM_Common_BDTCUPR_TIMxOUTR HRTIM_OUTxR register update enable **/
#define HRTIM_Common_BDTCUPR_TIMxOUTR		(1 << 19)
/** HRTIM_Common_BDTCUPR_TIMxCHPR HRTIM_CHPxR register update enable **/
#define HRTIM_Common_BDTCUPR_TIMxCHPR		(1 << 18)
/** HRTIM_Common_BDTCUPR_TIMxRSTR HRTIM_RSTxR register update enable **/
#define HRTIM_Common_BDTCUPR_TIMxRSTR		(1 << 17)
/** HRTIM_Common_BDTCUPR_TIMxEEFR2 HRTIM_EEFxR2 register update enable **/
#define HRTIM_Common_BDTCUPR_TIMxEEFR2		(1 << 16)
/** HRTIM_Common_BDTCUPR_TIMxEEFR1 HRTIM_EEFxR1 register update enable **/
#define HRTIM_Common_BDTCUPR_TIMxEEFR1		(1 << 15)
/** HRTIM_Common_BDTCUPR_TIMxRST2R HRTIM_RST2xR register update enable **/
#define HRTIM_Common_BDTCUPR_TIMxRST2R		(1 << 14)
/** HRTIM_Common_BDTCUPR_TIMxSET2R HRTIM_SET2xR register update enable **/
#define HRTIM_Common_BDTCUPR_TIMxSET2R		(1 << 13)
/** HRTIM_Common_BDTCUPR_TIMxRST1R HRTIM_RST1xR register update enable **/
#define HRTIM_Common_BDTCUPR_TIMxRST1R		(1 << 12)
/** HRTIM_Common_BDTCUPR_TIMxSET1R HRTIM_SET1xR register update enable **/
#define HRTIM_Common_BDTCUPR_TIMxSET1R		(1 << 11)
/** HRTIM_Common_BDTCUPR_TIMx_DTxR HRTIM_DTxR register update enable **/
#define HRTIM_Common_BDTCUPR_TIMx_DTxR		(1 << 10)
/** HRTIM_Common_BDTCUPR_TIMxCMP4 HRTIM_CMP4xR register update enable **/
#define HRTIM_Common_BDTCUPR_TIMxCMP4		(1 << 9)
/** HRTIM_Common_BDTCUPR_TIMxCMP3 HRTIM_CMP3xR register update enable **/
#define HRTIM_Common_BDTCUPR_TIMxCMP3		(1 << 8)
/** HRTIM_Common_BDTCUPR_TIMxCMP2 HRTIM_CMP2xR register update enable **/
#define HRTIM_Common_BDTCUPR_TIMxCMP2		(1 << 7)
/** HRTIM_Common_BDTCUPR_TIMxCMP1 HRTIM_CMP1xR register update enable **/
#define HRTIM_Common_BDTCUPR_TIMxCMP1		(1 << 6)
/** HRTIM_Common_BDTCUPR_TIMxREP HRTIM_REPxR register update enable **/
#define HRTIM_Common_BDTCUPR_TIMxREP		(1 << 5)
/** HRTIM_Common_BDTCUPR_TIMxPER HRTIM_PERxR register update enable **/
#define HRTIM_Common_BDTCUPR_TIMxPER		(1 << 4)
/** HRTIM_Common_BDTCUPR_TIMxCNT HRTIM_CNTxR register update enable **/
#define HRTIM_Common_BDTCUPR_TIMxCNT		(1 << 3)
/** HRTIM_Common_BDTCUPR_TIMxDIER HRTIM_TIMxDIER register update enable **/
#define HRTIM_Common_BDTCUPR_TIMxDIER		(1 << 2)
/** HRTIM_Common_BDTCUPR_TIMxICR HRTIM_TIMxICR register update enable **/
#define HRTIM_Common_BDTCUPR_TIMxICR		(1 << 1)
/** HRTIM_Common_BDTCUPR_TIMxCR HRTIM_TIMxCR register update enable **/
#define HRTIM_Common_BDTCUPR_TIMxCR		(1 << 0)

/**@}*/

/** @defgroup hrtim_common_bdtdupr BDTDUPR Burst DMA Timerx update Register
@{*/

/** HRTIM_Common_BDTDUPR_TIMxEEFR3 TIMxEEFR3 **/
#define HRTIM_Common_BDTDUPR_TIMxEEFR3		(1 << 22)
/** HRTIM_Common_BDTDUPR_TIMxCR2 TIMxCR2 **/
#define HRTIM_Common_BDTDUPR_TIMxCR2		(1 << 21)
/** HRTIM_Common_BDTDUPR_TIMxFLTR HRTIM_FLTxR register update enable **/
#define HRTIM_Common_BDTDUPR_TIMxFLTR		(1 << 20)
/** HRTIM_Common_BDTDUPR_TIMxOUTR HRTIM_OUTxR register update enable **/
#define HRTIM_Common_BDTDUPR_TIMxOUTR		(1 << 19)
/** HRTIM_Common_BDTDUPR_TIMxCHPR HRTIM_CHPxR register update enable **/
#define HRTIM_Common_BDTDUPR_TIMxCHPR		(1 << 18)
/** HRTIM_Common_BDTDUPR_TIMxRSTR HRTIM_RSTxR register update enable **/
#define HRTIM_Common_BDTDUPR_TIMxRSTR		(1 << 17)
/** HRTIM_Common_BDTDUPR_TIMxEEFR2 HRTIM_EEFxR2 register update enable **/
#define HRTIM_Common_BDTDUPR_TIMxEEFR2		(1 << 16)
/** HRTIM_Common_BDTDUPR_TIMxEEFR1 HRTIM_EEFxR1 register update enable **/
#define HRTIM_Common_BDTDUPR_TIMxEEFR1		(1 << 15)
/** HRTIM_Common_BDTDUPR_TIMxRST2R HRTIM_RST2xR register update enable **/
#define HRTIM_Common_BDTDUPR_TIMxRST2R		(1 << 14)
/** HRTIM_Common_BDTDUPR_TIMxSET2R HRTIM_SET2xR register update enable **/
#define HRTIM_Common_BDTDUPR_TIMxSET2R		(1 << 13)
/** HRTIM_Common_BDTDUPR_TIMxRST1R HRTIM_RST1xR register update enable **/
#define HRTIM_Common_BDTDUPR_TIMxRST1R		(1 << 12)
/** HRTIM_Common_BDTDUPR_TIMxSET1R HRTIM_SET1xR register update enable **/
#define HRTIM_Common_BDTDUPR_TIMxSET1R		(1 << 11)
/** HRTIM_Common_BDTDUPR_TIMx_DTxR HRTIM_DTxR register update enable **/
#define HRTIM_Common_BDTDUPR_TIMx_DTxR		(1 << 10)
/** HRTIM_Common_BDTDUPR_TIMxCMP4 HRTIM_CMP4xR register update enable **/
#define HRTIM_Common_BDTDUPR_TIMxCMP4		(1 << 9)
/** HRTIM_Common_BDTDUPR_TIMxCMP3 HRTIM_CMP3xR register update enable **/
#define HRTIM_Common_BDTDUPR_TIMxCMP3		(1 << 8)
/** HRTIM_Common_BDTDUPR_TIMxCMP2 HRTIM_CMP2xR register update enable **/
#define HRTIM_Common_BDTDUPR_TIMxCMP2		(1 << 7)
/** HRTIM_Common_BDTDUPR_TIMxCMP1 HRTIM_CMP1xR register update enable **/
#define HRTIM_Common_BDTDUPR_TIMxCMP1		(1 << 6)
/** HRTIM_Common_BDTDUPR_TIMxREP HRTIM_REPxR register update enable **/
#define HRTIM_Common_BDTDUPR_TIMxREP		(1 << 5)
/** HRTIM_Common_BDTDUPR_TIMxPER HRTIM_PERxR register update enable **/
#define HRTIM_Common_BDTDUPR_TIMxPER		(1 << 4)
/** HRTIM_Common_BDTDUPR_TIMxCNT HRTIM_CNTxR register update enable **/
#define HRTIM_Common_BDTDUPR_TIMxCNT		(1 << 3)
/** HRTIM_Common_BDTDUPR_TIMxDIER HRTIM_TIMxDIER register update enable **/
#define HRTIM_Common_BDTDUPR_TIMxDIER		(1 << 2)
/** HRTIM_Common_BDTDUPR_TIMxICR HRTIM_TIMxICR register update enable **/
#define HRTIM_Common_BDTDUPR_TIMxICR		(1 << 1)
/** HRTIM_Common_BDTDUPR_TIMxCR HRTIM_TIMxCR register update enable **/
#define HRTIM_Common_BDTDUPR_TIMxCR		(1 << 0)

/**@}*/

/** @defgroup hrtim_common_bdteupr BDTEUPR Burst DMA Timerx update Register
@{*/

/** HRTIM_Common_BDTEUPR_TIMxEEFR3 TIMxEEFR3 **/
#define HRTIM_Common_BDTEUPR_TIMxEEFR3		(1 << 22)
/** HRTIM_Common_BDTEUPR_TIMxCR2 TIMxCR2 **/
#define HRTIM_Common_BDTEUPR_TIMxCR2		(1 << 21)
/** HRTIM_Common_BDTEUPR_TIMxFLTR HRTIM_FLTxR register update enable **/
#define HRTIM_Common_BDTEUPR_TIMxFLTR		(1 << 20)
/** HRTIM_Common_BDTEUPR_TIMxOUTR HRTIM_OUTxR register update enable **/
#define HRTIM_Common_BDTEUPR_TIMxOUTR		(1 << 19)
/** HRTIM_Common_BDTEUPR_TIMxCHPR HRTIM_CHPxR register update enable **/
#define HRTIM_Common_BDTEUPR_TIMxCHPR		(1 << 18)
/** HRTIM_Common_BDTEUPR_TIMxRSTR HRTIM_RSTxR register update enable **/
#define HRTIM_Common_BDTEUPR_TIMxRSTR		(1 << 17)
/** HRTIM_Common_BDTEUPR_TIMxEEFR2 HRTIM_EEFxR2 register update enable **/
#define HRTIM_Common_BDTEUPR_TIMxEEFR2		(1 << 16)
/** HRTIM_Common_BDTEUPR_TIMxEEFR1 HRTIM_EEFxR1 register update enable **/
#define HRTIM_Common_BDTEUPR_TIMxEEFR1		(1 << 15)
/** HRTIM_Common_BDTEUPR_TIMxRST2R HRTIM_RST2xR register update enable **/
#define HRTIM_Common_BDTEUPR_TIMxRST2R		(1 << 14)
/** HRTIM_Common_BDTEUPR_TIMxSET2R HRTIM_SET2xR register update enable **/
#define HRTIM_Common_BDTEUPR_TIMxSET2R		(1 << 13)
/** HRTIM_Common_BDTEUPR_TIMxRST1R HRTIM_RST1xR register update enable **/
#define HRTIM_Common_BDTEUPR_TIMxRST1R		(1 << 12)
/** HRTIM_Common_BDTEUPR_TIMxSET1R HRTIM_SET1xR register update enable **/
#define HRTIM_Common_BDTEUPR_TIMxSET1R		(1 << 11)
/** HRTIM_Common_BDTEUPR_TIMx_DTxR HRTIM_DTxR register update enable **/
#define HRTIM_Common_BDTEUPR_TIMx_DTxR		(1 << 10)
/** HRTIM_Common_BDTEUPR_TIMxCMP4 HRTIM_CMP4xR register update enable **/
#define HRTIM_Common_BDTEUPR_TIMxCMP4		(1 << 9)
/** HRTIM_Common_BDTEUPR_TIMxCMP3 HRTIM_CMP3xR register update enable **/
#define HRTIM_Common_BDTEUPR_TIMxCMP3		(1 << 8)
/** HRTIM_Common_BDTEUPR_TIMxCMP2 HRTIM_CMP2xR register update enable **/
#define HRTIM_Common_BDTEUPR_TIMxCMP2		(1 << 7)
/** HRTIM_Common_BDTEUPR_TIMxCMP1 HRTIM_CMP1xR register update enable **/
#define HRTIM_Common_BDTEUPR_TIMxCMP1		(1 << 6)
/** HRTIM_Common_BDTEUPR_TIMxREP HRTIM_REPxR register update enable **/
#define HRTIM_Common_BDTEUPR_TIMxREP		(1 << 5)
/** HRTIM_Common_BDTEUPR_TIMxPER HRTIM_PERxR register update enable **/
#define HRTIM_Common_BDTEUPR_TIMxPER		(1 << 4)
/** HRTIM_Common_BDTEUPR_TIMxCNT HRTIM_CNTxR register update enable **/
#define HRTIM_Common_BDTEUPR_TIMxCNT		(1 << 3)
/** HRTIM_Common_BDTEUPR_TIMxDIER HRTIM_TIMxDIER register update enable **/
#define HRTIM_Common_BDTEUPR_TIMxDIER		(1 << 2)
/** HRTIM_Common_BDTEUPR_TIMxICR HRTIM_TIMxICR register update enable **/
#define HRTIM_Common_BDTEUPR_TIMxICR		(1 << 1)
/** HRTIM_Common_BDTEUPR_TIMxCR HRTIM_TIMxCR register update enable **/
#define HRTIM_Common_BDTEUPR_TIMxCR		(1 << 0)

/**@}*/

/** @defgroup hrtim_common_bdmadr BDMADR Burst DMA Data Register
@{*/


