grevaillot/svd_tools/headers/STM32G474xx/hrtim_common.h
#define HRTIM_Common_BDMADR_BDMADR_SHIFT		0
#define HRTIM_Common_BDMADR_BDMADR_MASK		0xffffffff
/** @defgroup hrtim_common_bdmadr_bdmadr BDMADR Burst DMA Data register
@{*/
/**@}*/


/**@}*/

/** @defgroup hrtim_common_bdtfupr BDTFUPR Burst DMA Timerx update Register
@{*/

/** HRTIM_Common_BDTFUPR_TIMxEEFR3 TIMxEEFR3 **/
#define HRTIM_Common_BDTFUPR_TIMxEEFR3		(1 << 22)
/** HRTIM_Common_BDTFUPR_TIMxCR2 TIMxCR2 **/
#define HRTIM_Common_BDTFUPR_TIMxCR2		(1 << 21)
/** HRTIM_Common_BDTFUPR_TIMxFLTR HRTIM_FLTxR register update enable **/
#define HRTIM_Common_BDTFUPR_TIMxFLTR		(1 << 20)
/** HRTIM_Common_BDTFUPR_TIMxOUTR HRTIM_OUTxR register update enable **/
#define HRTIM_Common_BDTFUPR_TIMxOUTR		(1 << 19)
/** HRTIM_Common_BDTFUPR_TIMxCHPR HRTIM_CHPxR register update enable **/
#define HRTIM_Common_BDTFUPR_TIMxCHPR		(1 << 18)
/** HRTIM_Common_BDTFUPR_TIMxRSTR HRTIM_RSTxR register update enable **/
#define HRTIM_Common_BDTFUPR_TIMxRSTR		(1 << 17)
/** HRTIM_Common_BDTFUPR_TIMxEEFR2 HRTIM_EEFxR2 register update enable **/
#define HRTIM_Common_BDTFUPR_TIMxEEFR2		(1 << 16)
/** HRTIM_Common_BDTFUPR_TIMxEEFR1 HRTIM_EEFxR1 register update enable **/
#define HRTIM_Common_BDTFUPR_TIMxEEFR1		(1 << 15)
/** HRTIM_Common_BDTFUPR_TIMxRST2R HRTIM_RST2xR register update enable **/
#define HRTIM_Common_BDTFUPR_TIMxRST2R		(1 << 14)
/** HRTIM_Common_BDTFUPR_TIMxSET2R HRTIM_SET2xR register update enable **/
#define HRTIM_Common_BDTFUPR_TIMxSET2R		(1 << 13)
/** HRTIM_Common_BDTFUPR_TIMxRST1R HRTIM_RST1xR register update enable **/
#define HRTIM_Common_BDTFUPR_TIMxRST1R		(1 << 12)
/** HRTIM_Common_BDTFUPR_TIMxSET1R HRTIM_SET1xR register update enable **/
#define HRTIM_Common_BDTFUPR_TIMxSET1R		(1 << 11)
/** HRTIM_Common_BDTFUPR_TIMx_DTxR HRTIM_DTxR register update enable **/
#define HRTIM_Common_BDTFUPR_TIMx_DTxR		(1 << 10)
/** HRTIM_Common_BDTFUPR_TIMxCMP4 HRTIM_CMP4xR register update enable **/
#define HRTIM_Common_BDTFUPR_TIMxCMP4		(1 << 9)
/** HRTIM_Common_BDTFUPR_TIMxCMP3 HRTIM_CMP3xR register update enable **/
#define HRTIM_Common_BDTFUPR_TIMxCMP3		(1 << 8)
/** HRTIM_Common_BDTFUPR_TIMxCMP2 HRTIM_CMP2xR register update enable **/
#define HRTIM_Common_BDTFUPR_TIMxCMP2		(1 << 7)
/** HRTIM_Common_BDTFUPR_TIMxCMP1 HRTIM_CMP1xR register update enable **/
#define HRTIM_Common_BDTFUPR_TIMxCMP1		(1 << 6)
/** HRTIM_Common_BDTFUPR_TIMxREP HRTIM_REPxR register update enable **/
#define HRTIM_Common_BDTFUPR_TIMxREP		(1 << 5)
/** HRTIM_Common_BDTFUPR_TIMxPER HRTIM_PERxR register update enable **/
#define HRTIM_Common_BDTFUPR_TIMxPER		(1 << 4)
/** HRTIM_Common_BDTFUPR_TIMxCNT HRTIM_CNTxR register update enable **/
#define HRTIM_Common_BDTFUPR_TIMxCNT		(1 << 3)
/** HRTIM_Common_BDTFUPR_TIMxDIER HRTIM_TIMxDIER register update enable **/
#define HRTIM_Common_BDTFUPR_TIMxDIER		(1 << 2)
/** HRTIM_Common_BDTFUPR_TIMxICR HRTIM_TIMxICR register update enable **/
#define HRTIM_Common_BDTFUPR_TIMxICR		(1 << 1)
/** HRTIM_Common_BDTFUPR_TIMxCR HRTIM_TIMxCR register update enable **/
#define HRTIM_Common_BDTFUPR_TIMxCR		(1 << 0)

/**@}*/

/** @defgroup hrtim_common_adcer ADCER HRTIM ADC Extended Trigger Register
@{*/


#define HRTIM_Common_ADCER_ADC10TRG_SHIFT		26
#define HRTIM_Common_ADCER_ADC10TRG_MASK		0x1f
/** @defgroup hrtim_common_adcer_adc10trg ADC10TRG ADC10TRG
@{*/
/**@}*/


#define HRTIM_Common_ADCER_ADC9TRG_SHIFT		21
#define HRTIM_Common_ADCER_ADC9TRG_MASK		0x1f
/** @defgroup hrtim_common_adcer_adc9trg ADC9TRG ADC9TRG
@{*/
/**@}*/


#define HRTIM_Common_ADCER_ADC8TRG_SHIFT		16
#define HRTIM_Common_ADCER_ADC8TRG_MASK		0x1f
/** @defgroup hrtim_common_adcer_adc8trg ADC8TRG ADC8TRG
@{*/
/**@}*/


#define HRTIM_Common_ADCER_ADC7TRG_SHIFT		10
#define HRTIM_Common_ADCER_ADC7TRG_MASK		0x1f
/** @defgroup hrtim_common_adcer_adc7trg ADC7TRG ADC7TRG
@{*/
/**@}*/


#define HRTIM_Common_ADCER_ADC6TRG_SHIFT		5
#define HRTIM_Common_ADCER_ADC6TRG_MASK		0x1f
/** @defgroup hrtim_common_adcer_adc6trg ADC6TRG ADC6TRG
@{*/
/**@}*/


#define HRTIM_Common_ADCER_ADC5TRG_SHIFT		0
#define HRTIM_Common_ADCER_ADC5TRG_MASK		0x1f
/** @defgroup hrtim_common_adcer_adc5trg ADC5TRG ADC5TRG
@{*/
/**@}*/


/**@}*/

/** @defgroup hrtim_common_adcur ADCUR HRTIM ADC Trigger Update Register
@{*/


#define HRTIM_Common_ADCUR_AD10USRC_SHIFT		20
#define HRTIM_Common_ADCUR_AD10USRC_MASK		0x07
/** @defgroup hrtim_common_adcur_ad10usrc AD10USRC AD10USRC
@{*/
/**@}*/


#define HRTIM_Common_ADCUR_AD9USRC_SHIFT		16
#define HRTIM_Common_ADCUR_AD9USRC_MASK		0x07
/** @defgroup hrtim_common_adcur_ad9usrc AD9USRC AD9USRC
@{*/
/**@}*/


#define HRTIM_Common_ADCUR_AD8USRC_SHIFT		12
#define HRTIM_Common_ADCUR_AD8USRC_MASK		0x07
/** @defgroup hrtim_common_adcur_ad8usrc AD8USRC AD8USRC
@{*/
/**@}*/


#define HRTIM_Common_ADCUR_AD7USRC_SHIFT		8
#define HRTIM_Common_ADCUR_AD7USRC_MASK		0x07
/** @defgroup hrtim_common_adcur_ad7usrc AD7USRC AD7USRC
@{*/
/**@}*/


#define HRTIM_Common_ADCUR_AD6USRC_SHIFT		4
#define HRTIM_Common_ADCUR_AD6USRC_MASK		0x07
/** @defgroup hrtim_common_adcur_ad6usrc AD6USRC AD6USRC
@{*/
/**@}*/


#define HRTIM_Common_ADCUR_AD5USRC_SHIFT		0
#define HRTIM_Common_ADCUR_AD5USRC_MASK		0x07
/** @defgroup hrtim_common_adcur_ad5usrc AD5USRC AD5USRC
@{*/
/**@}*/


/**@}*/

/** @defgroup hrtim_common_adcps1 ADCPS1 HRTIM ADC Post Scaler Register 1
@{*/


#define HRTIM_Common_ADCPS1_ADC5PSC_SHIFT		24
#define HRTIM_Common_ADCPS1_ADC5PSC_MASK		0x1f
/** @defgroup hrtim_common_adcps1_adc5psc ADC5PSC ADC5PSC
@{*/
/**@}*/


#define HRTIM_Common_ADCPS1_ADC4PSC_SHIFT		18
#define HRTIM_Common_ADCPS1_ADC4PSC_MASK		0x1f
/** @defgroup hrtim_common_adcps1_adc4psc ADC4PSC ADC4PSC
@{*/
/**@}*/


#define HRTIM_Common_ADCPS1_ADC3PSC_SHIFT		12
#define HRTIM_Common_ADCPS1_ADC3PSC_MASK		0x1f
/** @defgroup hrtim_common_adcps1_adc3psc ADC3PSC ADC3PSC
@{*/
/**@}*/


#define HRTIM_Common_ADCPS1_ADC2PSC_SHIFT		6
#define HRTIM_Common_ADCPS1_ADC2PSC_MASK		0x1f
/** @defgroup hrtim_common_adcps1_adc2psc ADC2PSC ADC2PSC
@{*/
/**@}*/


#define HRTIM_Common_ADCPS1_ADC1PSC_SHIFT		0
#define HRTIM_Common_ADCPS1_ADC1PSC_MASK		0x1f
/** @defgroup hrtim_common_adcps1_adc1psc ADC1PSC ADC1PSC
@{*/
/**@}*/


/**@}*/

/** @defgroup hrtim_common_adcps2 ADCPS2 HRTIM ADC Post Scaler Register 2
@{*/


#define HRTIM_Common_ADCPS2_ADC10PSC_SHIFT		24
#define HRTIM_Common_ADCPS2_ADC10PSC_MASK		0x1f
/** @defgroup hrtim_common_adcps2_adc10psc ADC10PSC ADC10PSC
@{*/
/**@}*/


