grevaillot/svd_tools/headers/STM32G474xx/hrtim_common.h
#define HRTIM_Common_ADCPS2_ADC9PSC_SHIFT		18
#define HRTIM_Common_ADCPS2_ADC9PSC_MASK		0x1f
/** @defgroup hrtim_common_adcps2_adc9psc ADC9PSC ADC9PSC
@{*/
/**@}*/


#define HRTIM_Common_ADCPS2_ADC8PSC_SHIFT		12
#define HRTIM_Common_ADCPS2_ADC8PSC_MASK		0x1f
/** @defgroup hrtim_common_adcps2_adc8psc ADC8PSC ADC8PSC
@{*/
/**@}*/


#define HRTIM_Common_ADCPS2_ADC7PSC_SHIFT		6
#define HRTIM_Common_ADCPS2_ADC7PSC_MASK		0x1f
/** @defgroup hrtim_common_adcps2_adc7psc ADC7PSC ADC7PSC
@{*/
/**@}*/


#define HRTIM_Common_ADCPS2_ADC6PSC_SHIFT		0
#define HRTIM_Common_ADCPS2_ADC6PSC_MASK		0x1f
/** @defgroup hrtim_common_adcps2_adc6psc ADC6PSC ADC6PSC
@{*/
/**@}*/


/**@}*/

/** @defgroup hrtim_common_fltinr3 FLTINR3 HRTIM Fault Input Register 3
@{*/

/** HRTIM_Common_FLTINR3_FLT4RSTM FLT4RSTM **/
#define HRTIM_Common_FLTINR3_FLT4RSTM		(1 << 31)
/** HRTIM_Common_FLTINR3_FLT4CRES FLT4CRES **/
#define HRTIM_Common_FLTINR3_FLT4CRES		(1 << 30)

#define HRTIM_Common_FLTINR3_FLT4CNT_SHIFT		26
#define HRTIM_Common_FLTINR3_FLT4CNT_MASK		0x0f
/** @defgroup hrtim_common_fltinr3_flt4cnt FLT4CNT FLT4CNT
@{*/
/**@}*/

/** HRTIM_Common_FLTINR3_FLT4BLKS FLT4BLKS **/
#define HRTIM_Common_FLTINR3_FLT4BLKS		(1 << 25)
/** HRTIM_Common_FLTINR3_FLT4BLKE FLT4BLKE **/
#define HRTIM_Common_FLTINR3_FLT4BLKE		(1 << 24)
/** HRTIM_Common_FLTINR3_FLT3RSTM FLT3RSTM **/
#define HRTIM_Common_FLTINR3_FLT3RSTM		(1 << 23)
/** HRTIM_Common_FLTINR3_FLT3CRES FLT3CRES **/
#define HRTIM_Common_FLTINR3_FLT3CRES		(1 << 22)

#define HRTIM_Common_FLTINR3_FLT3CNT_SHIFT		18
#define HRTIM_Common_FLTINR3_FLT3CNT_MASK		0x0f
/** @defgroup hrtim_common_fltinr3_flt3cnt FLT3CNT FLT3CNT
@{*/
/**@}*/

/** HRTIM_Common_FLTINR3_FLT3BLKS FLT3BLKS **/
#define HRTIM_Common_FLTINR3_FLT3BLKS		(1 << 17)
/** HRTIM_Common_FLTINR3_FLT3BLKE FLT3BLKE **/
#define HRTIM_Common_FLTINR3_FLT3BLKE		(1 << 16)
/** HRTIM_Common_FLTINR3_FLT2RSTM FLT2RSTM **/
#define HRTIM_Common_FLTINR3_FLT2RSTM		(1 << 15)
/** HRTIM_Common_FLTINR3_FLT2CRES FLT2CRES **/
#define HRTIM_Common_FLTINR3_FLT2CRES		(1 << 14)

#define HRTIM_Common_FLTINR3_FLT2CNT_SHIFT		10
#define HRTIM_Common_FLTINR3_FLT2CNT_MASK		0x0f
/** @defgroup hrtim_common_fltinr3_flt2cnt FLT2CNT FLT2CNT
@{*/
/**@}*/

/** HRTIM_Common_FLTINR3_FLT2BLKS FLT2BLKS **/
#define HRTIM_Common_FLTINR3_FLT2BLKS		(1 << 9)
/** HRTIM_Common_FLTINR3_FLT2BLKE FLT2BLKE **/
#define HRTIM_Common_FLTINR3_FLT2BLKE		(1 << 8)
/** HRTIM_Common_FLTINR3_FLT1RSTM FLT1RSTM **/
#define HRTIM_Common_FLTINR3_FLT1RSTM		(1 << 7)
/** HRTIM_Common_FLTINR3_FLT1CRES FLT1CRES **/
#define HRTIM_Common_FLTINR3_FLT1CRES		(1 << 6)

#define HRTIM_Common_FLTINR3_FLT1CNT_SHIFT		2
#define HRTIM_Common_FLTINR3_FLT1CNT_MASK		0x0f
/** @defgroup hrtim_common_fltinr3_flt1cnt FLT1CNT FLT1CNT
@{*/
/**@}*/

/** HRTIM_Common_FLTINR3_FLT1BLKS FLT1BLKS **/
#define HRTIM_Common_FLTINR3_FLT1BLKS		(1 << 1)
/** HRTIM_Common_FLTINR3_FLT1BLKE FLT1BLKE **/
#define HRTIM_Common_FLTINR3_FLT1BLKE		(1 << 0)

/**@}*/

/** @defgroup hrtim_common_fltinr4 FLTINR4 HRTIM Fault Input Register 4
@{*/

/** HRTIM_Common_FLTINR4_FLT6RSTM FLT6RSTM **/
#define HRTIM_Common_FLTINR4_FLT6RSTM		(1 << 15)
/** HRTIM_Common_FLTINR4_FLT6CRES FLT6CRES **/
#define HRTIM_Common_FLTINR4_FLT6CRES		(1 << 14)

#define HRTIM_Common_FLTINR4_FLT6CNT_SHIFT		10
#define HRTIM_Common_FLTINR4_FLT6CNT_MASK		0x0f
/** @defgroup hrtim_common_fltinr4_flt6cnt FLT6CNT FLT6CNT
@{*/
/**@}*/

/** HRTIM_Common_FLTINR4_FLT6BLKS FLT6BLKS **/
#define HRTIM_Common_FLTINR4_FLT6BLKS		(1 << 9)
/** HRTIM_Common_FLTINR4_FLT6BLKE FLT6BLKE **/
#define HRTIM_Common_FLTINR4_FLT6BLKE		(1 << 8)
/** HRTIM_Common_FLTINR4_FLT5RSTM FLT5RSTM **/
#define HRTIM_Common_FLTINR4_FLT5RSTM		(1 << 7)
/** HRTIM_Common_FLTINR4_FLT5CRES FLT5CRES **/
#define HRTIM_Common_FLTINR4_FLT5CRES		(1 << 6)

#define HRTIM_Common_FLTINR4_FLT5CNT_SHIFT		2
#define HRTIM_Common_FLTINR4_FLT5CNT_MASK		0x0f
/** @defgroup hrtim_common_fltinr4_flt5cnt FLT5CNT FLT5CNT
@{*/
/**@}*/

/** HRTIM_Common_FLTINR4_FLT5BLKS FLT5BLKS **/
#define HRTIM_Common_FLTINR4_FLT5BLKS		(1 << 1)
/** HRTIM_Common_FLTINR4_FLT5BLKE FLT5BLKE **/
#define HRTIM_Common_FLTINR4_FLT5BLKE		(1 << 0)

/**@}*/
